// https://childdevelop.com.ua/worksheets/5632/?fbclid=IwAR0Cf_g7UKKucT4CRZeoH-En7A-rlHaIxH2F0tmWKq5X3Hnx1_ahlbCSbjE

/*
УМОВА
Є математичні приклади. 

8 - 8 =
5 - 4 =
3 + 4 =
1 + 1 =

Їх потрібно розв'язати. Результат кожного прикладу треба набрати на приладі, 
схожому на телефон. На кнопках цього приладу є і цифри, і літери. Коли натискаєш цифру, 
то на дисплеї з'являється відповідна кнопці літера. Таким чином, 
за допомогою розв'язаних прикладів складаємо слово.

*/


let num = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9];
let abc = ['д', 'и', 'я', 'о', 'ш', 'б', 'л', 'н', 'а', 'с'];

let t1 = 8 - 8; // 0
let t2 = 5 - 4; // 1
let t3 = 3 + 4; // 7
let t4 = 1 + 1; // 2

let l1 = abc[t1];
let l2 = abc[t2];
let l3 = abc[t3];
let l4 = abc[t4];

console.log(l1 + l2 + l3 + l4);

// ВІДПОВІДЬ: диня